Revit 2026 API

# CriticalPathCollector Properties

---

The CriticalPathCollector type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

CriticalPathCollector Class

Autodesk.Revit.DB.Analysis Namespace